export const quizData = [
  {
    question:
      'Обладаете ли вы достаточным уровнем знаний и пониманием выполнения базовых движений?',
    options: [
      {
        text: 'Понимаю упражнения в общих чертах, часто сомневаюсь в технике и боюсь делать неправильно',
        img: '❌',
        level: 2,
      },
      {
        text: 'Хорошо знаю технику базовых упражнений и выполняю их уверенно и осознанно',
        img: '✅',
        level: 1,
      },
    ],
  },
  {
    question: 'Как часто вы тренировались в последние 3 месяца?',
    options: [
      {
        text: 'Тренировалась редко или нерегулярно (0–1 раз в неделю, с большими перерывами)',
        img: '🛋️',
        level: 2,
      },
      {
        text: 'Тренируюсь стабильно 3 и более раз в неделю',
        img: '🏋️‍♀️',
        level: 1,
      },
    ],
  },
  {
    question: 'Как вы оцениваете свою силу?',
    options: [
      {
        text: 'Сложно выполнять базовые упражнения (приседания, отжимания), быстро устаю',
        img: '🫠',
        level: 2,
      },
      {
        text: 'Уверенно выполняю упражнения с весом собственного тела и/или дополнительным отягощением',
        img: '💪',
        level: 1,
      },
    ],
  },
  {
    question: 'Как оцениваете свою выносливость?',
    options: [
      {
        text: 'Устаю через 15–25 минут тренировки, часто появляется одышка, нужен частый отдых, мало сил',
        img: '😮‍💨',
        level: 2,
      },
      {
        text: 'Могу тренироваться 40–60 минут и более без сильной одышки, темп держу стабильно',
        img: '🚀',
        level: 1,
      },
    ],
  },
  {
    question: 'Какой у вас уровень физической активности в повседневной жизни?',
    options: [
      {
        text: 'Большую часть дня сижу, малоподвижный образ жизни прохожу в среднем меньше 3-6 тысяч шагов в день, тренировки редкие или отсутствуют ',
        img: '🛋️',
        level: 2,
      },
      {
        text: 'Много двигаюсь, регулярно хожу пешком, в среднем 8–12 тысяч шагов в день и больше, посещаю регулярно тренировки',
        img: '🚶‍♀️',
        level: 1,
      },
    ],
  },
  {
    question: 'Как вы чувствуете себя после тренировки?',
    options: [
      {
        text: 'Чувствую сильную усталость, мышцы долго болят, восстановление занимает 1–2 дня',
        img: '🥵',
        level: 2,
      },
      {
        text: 'Устаю умеренно, на следующий день чувствую себя нормально и могу снова быть активной',
        img: '😌',
        level: 1,
      },
    ],
  },
  {
    question: 'Какой уровень сложности тренировок вам комфортен?',
    options: [
      {
        text: 'Предпочитаю более лёгкие тренировки, важно не перегружаться и не работать на износ',
        img: '😰',
        level: 2,
      },
      {
        text: 'Люблю сложные и интенсивные тренировки, мне нравится ощущение вызова',
        img: '🔥',
        level: 1,
      },
    ],
  },
];

export const quizResults = {
  Профи:
    'У вас уверенный уровень подготовки,и вы готовы к интенсивным тренировкам. Наши программы помогут вам развить силу, выносливость и достичь новых спортивных целей!',
  Новичок:
    'Вы только начинаете свой путь в фитнесе. Мы подготовили для вас программы с упором на технику, постепенную адаптацию и безопасное повышение нагрузки.',
};
