export const quizData = [
  {
    question:
      'Обладаете ли вы достаточным уровнем знаний и пониманием выполнения базовых движений?',
    options: [
      { text: 'Да, знаю технику и выполняю уверенно', img: '✅', level: 1 },
      { text: 'Нет, не уверен(а) в технике', img: '❌', level: 2 },
    ],
  },
  {
    question: 'Как часто вы тренировались в последние 3 месяца?',
    options: [
      { text: 'Регулярно (3-5 раз в неделю)', img: '🏋️‍♀️', level: 1 },
      { text: 'Иногда (1-2 раза в неделю)', img: '🛋️', level: 2 },
    ],
  },
  {
    question: 'Как вы оцениваете свою силу?',
    options: [
      { text: 'Высокая', img: '💪', level: 1 },
      { text: 'Средняя', img: '🫠', level: 2 },
    ],
  },
  {
    question: 'Как оцениваете свою выносливость?',
    options: [
      { text: 'Высокая', img: '🚀', level: 1 },
      { text: 'Средняя', img: '😓', level: 2 },
    ],
  },
  {
    question: 'Какой у вас уровень физической активности в повседневной жизни?',
    options: [
      { text: 'Высокий', img: '🚶‍♀️', level: 1 },
      { text: 'Средний', img: '🛋️', level: 2 },
    ],
  },
  {
    question: 'Как вы чувствуете себя после тренировки?',
    options: [
      { text: 'Энергичным', img: '😌', level: 1 },
      { text: 'Уставшим', img: '😰', level: 2 },
    ],
  },
  {
    question: 'Какой уровень сложности тренировок вам комфортен?',
    options: [
      { text: 'Высокий', img: '🚀', level: 1 },
      { text: 'Средний', img: '🥵', level: 2 },
    ],
  },
];
