export const chooseActivityRadios = [
  {
    title: '🪑 Минимальная',
    subtitle: 'Сидячий образ жизни при отсутствии тренировок',
    badge: 1.2,
  },
  {
    title: '🚶 Небольшая',
    subtitle: 'Тренировки несколько раз в неделю, но малоподвижный образ жизни',
    badge: 1.375,
  },
  {
    title: '🏃 Средняя',
    subtitle: 'Активный образ жизни при регулярных занятиях спортом',
    badge: 1.46,
  },
  {
    title: '🏋️‍♂️ Выше среднего',
    subtitle: 'Интенсивные занятия спортом почти каждый день',
    badge: 1.55,
  },
  {
    title: '💪 Повышенная',
    subtitle: 'Ежедневные тренировки, физический труд',
    badge: 1.64,
  },
  {
    title: '🔥 Высокая',
    subtitle:
      'Ежедневные интенсивные тренировки, физический труд, ходьба в течение нескольких часов',
    badge: 1.72,
  },
  {
    title: '🚀 Очень высокая',
    subtitle:
      'Тренировки профессиональных спортсменов, тяжёлый ежедневный физический труд',
    badge: 1.9,
  },
] as const;
