export const notificationConfig = [
  {
    day: 'Сегодня',
    items: [
      {
        id: '1',
        title: 'Уведомление',
        time: '20 мин назад',
        description:
          '1 Чтобы отслеживать прогресс необходимо в конце каждой недели обновлять параметры.',
        read: false,
      },
    ],
  },
  {
    day: 'Вчера',
    items: [
      {
        id: '2',
        title: 'Уведомление',
        time: '15:24',
        description:
          '2 Чтобы отслеживать прогресс необходимо в конце каждой недели обновлять параметры.',
        read: true,
      },
      {
        id: '3',
        title: 'Уведомление',
        time: '14:24',
        description:
          '3 Чтобы отслеживать прогресс необходимо в конце каждой недели обновлять параметры.',
        read: true,
      },
    ],
  },
  {
    day: '01.01.2024',
    items: [
      {
        id: '4',
        title: 'Уведомление',
        time: '17:24',
        description:
          '4 Чтобы отслеживать прогресс необходимо в конце каждой недели обновлять параметры.',
        read: true,
      },
      {
        id: '5',
        title: 'Уведомление',
        time: '13:43',
        description:
          '5 Чтобы отслеживать прогресс необходимо в конце каждой недели обновлять параметры.',
        read: true,
      },
    ],
  },
];
